import { useState } from "react";
import styles from "./FAQ.module.css";

export default function FAQ() {
  const [activeItem, setActiveItem] = useState(null);

  const handleItemClick = (id) => {
    setActiveItem(activeItem === id ? null : id);
  };

  const items = [
    {
      id: 1,
      number: "(01)",
      title:
        "Що робити, якщо виникли труднощі з оплатою або помилка у виборі тарифу?",
      text: "Якщо у вас виникли проблеми з оплатою або ви помилились при виборі тарифу, будь ласка, зверніться до нашої служби підтримки. Контакти для зв’язку ви знайдете внизу сторінки на сайті.",
    },
    {
      id: 2,
      number: "(02)",
      title: "Чи можна купити квиток на місці?",
      text: "Купити квиток на місці можна, але кількість таких квитків обмежена. Рекомендуємо придбати квитки заздалегідь, щоб гарантувати своє місце на заході.",
    },
    {
      id: 3,
      number: "(03)",
      title: "Чи можна змінити ім’я учасника?",
      text: "Зміна імені учасника можлива лише в тому випадку, якщо квитки є іменними. Для цього, будь ласка, зверніться до нашої служби підтримки до події.",
    },
    {
      id: 4,
      number: "(04)",
      title: "Як я можу отримати квиток після покупки?",
      text: "Після успішної оплати квиток буде надіслано на вашу електронну пошту.",
    },
    {
      id: 5,
      number: "(05)",
      title: "Що робити, якщо я не отримав квиток на електронну пошту?",
      text: "Якщо ви не отримали квиток, перевірте папку зі спамом. Якщо квитка немає, будь ласка, зв’яжіться з нашою службою підтримки, для швидкого вирішення питання. Контакти ви знайдете на сайті - внизу сторінки.",
    },
    {
      id: 6,
      number: "(06)",
      title: "Чи можу я повернути квиток, якщо не зможу приїхати на захід?",
      text: "Ви маєте можливість повернути квиток не пізніше, ніж за 20 днів до дати конференції.",
    },
    {
      id: 7,
      number: "(07)",
      title:
        "Чи можу я зробити повернення квитка, якщо вже скористалася ним, і виникли непередбачені обставини?",
      text: "Повернення квитка після його використання можливе лише у разі непередбачених обставин. Згідно з законодавством України та умовами еквайрингу, повернення може бути розглянуте протягом 60 днів. Запит на повернення необхідно подати не пізніше ніж через 3 години після початку заходу. Для уточнень звертайтесь до служби підтримки, контакти якої ви знайдете внизу сайту.",
    },
  ];

  return (
    <section className={styles.sectionFAQ} id="FAQ">
      <div className="container">
        <h2 className={styles.titleFAQ}>FAQ</h2>
      </div>

      <ul className={styles.wrapperList}>
        {items.map((item) => {
          const isActive = activeItem === item.id;

          return (
            <li
              key={item.id}
              onClick={() => handleItemClick(item.id)}
              className={styles.itemLi}
            >
              <h3 className={styles.titleQList}>
                <span className={styles.number}>{item.number}</span>
                {item.title}
              </h3>

              <div
                className={`${styles.content} ${isActive ? styles.show : ""}`}
              >
                <p className={styles.contentText}>{item.text}</p>
              </div>
            </li>
          );
        })}
      </ul>
    </section>
  );
}
