export const ourValues = [
    {
    id: 1,
    number: "(01)",
    title: "<span>Глибина -</span> це коли ти нарешті ставиш собі чесні запитання",
    content: "Буде можливість докопатися до справжніх причин своїх рішень, реакцій і внутрішніх блоків. Без прикрас - зате з результатом.",
    },
    {
    id: 2,
    number: "(02)",
    title: "<span>Розуміння -</span> це коли твої думки сприймають без зайвих пояснень",
    content: "Ми створюємо простір, де можна говорити про особисте. Без страху, що не так зрозуміють. Тут не засуджують - тут слухають. Тут можна бути собою.",
    },
    {
    id: 3,
    number: "(03)",
    title: "<span>Тіло -</span> це не картинка з інстаграму, а жива історія твого досвіду",
    content: "Через практики ти відчуєш, як тіло реагує на правду і на фальш. Ми не будемо “робити вигляд” - будемо вчитися чути, відчувати і нарешті довіряти собі.",
    },
    {
    id: 4,
    number: "(04)",
    title: "Ми ставимось <span>до грошей</span> як до інструменту турботи, а не як до табу",
    content: "Ти навчишся говорити про фінанси відкрито, без сорому чи страху. Дізнаєшся, як вибудовувати стабільність, не зраджуючи своїй автентичності.",
    },
    {
    id: 5,
    number: "(05)",
    title: "Ми створюємо <span>жіноче коло</span> як ресурс, а не змагання",
    content: "Це місце, де жінки підтримують одна одну - без конкуренції, без “хто краща”. Тут ти можеш бути собою - і цього достатньо.",
    },
    {
    id: 6,
    number: "(06)",
    title: "Ми віримо в силу <span>української жінки -</span> без пафосу",
    content: "Бо ми бачимо її щодня: у виборі жити гідно, любити щиро, боротися - і при цьому залишатись ніжною. Ця конференція - саме про таку жінку. Про тебе.",
    },
]